[{"Title":"Toast Maker","Info":"Simple, Base64, Animated & Gradient based Toast messages.\n\nThis function can be found in Toast Maker option "},{"Title":"Dialog Maker","Info":"Simple, Base64, Animated, expiration, iOS dialogs available as free in app\n\nThere is another option ð—–ð˜‚ð˜€ð˜ð—¼ð—º ð——ð—¶ð—®ð—¹ð—¼ð—´ ð—¦ð—²ð—¿ð˜ƒð—²ð—¿ which handles many new VIP dialogs, Notification, Update Activity etc.. \nThese Dialogs can be editable with full customize function . This function completely available as VIP users only\n\nThe free dialogs can directly injectable to your app but need VIP "},{"Title":"Notification Maker","Info":"This feature can help you to show a Notification Popup when user open your app. \n\nThis option can be found in Notification Maker button "},{"Title":"Code Editor","Info":"This feature can help you write your personal texts and you can even save them in the Editor for loading later\n\n* You can even call Modder hub for opening text file from other apps like telegram, whatapp etc"},{"Title":"Java2Smali","Info":"* This feature can help you to learn Smali language real time by writing Java codes in editor.. \n\n* Unlike other Java2smali tools that available in market, this Java2smali available in our app can help you to compile multiple Java files , can detect custom multiple jar files and obviously can compile multiple Java files. The compiler support Java 8 mean lambda expressions. After compiling you can extract the final dex file to your local directory also.\n\n* The compiled dex file you can view the method and field lists by clicking the navigation option here you can again convert back to full class to Java codes or even single method body to java codes\n\nVIP users can run Java Console for running the dex file coming with Main class and main method "},{"Title":"XML Decompiler","Info":"You can decompile XML file into raw axml text and you can also compile the raw axml text to XML binary file also.. \n\nFor loading XML files there is no direct option but you only can run the XML files by calling Modder Hub app from other file manager or MT Manager open with method "},{"Title":"Apk Extractor","Info":"This feature can help you to extract apk or apks file to storage directory "},{"Title":"Signature Key Maker","Info":"This feature can help you make custom signing key for apk and it can even generate keys for MT Manager which is basically a VIP function in MT Manager "},{"Title":"Apk Protector","Info":"A number of tools are available that can help you to protect your app from reverse engineering "},{"Title":"Apk Functions","Info":"A number of tools are available for doing jobs for modify apk files "},{"Title":"Apk Cloner","Info":"This function can clone apk at manifest and resources.arsc level.. It's a VIP function in MT Manager but in Modder hub it's free\n\nThis function can be found in Apk Tools => Apk Functions "},{"Title":"Apk Dex String Decryption","Info":"This function can try to restore encrypted dex strings to normal raw strings.. It ca be fail if there is too much complexity in string Encryption \n\nThis function can be found in Apk Tools => Apk Functions "},{"Title":"Dex Anti-Confusion","Info":"This function can try to restore non english classes or fields or methods names into a random English name . Although there is some issues in the method name editing but you can simply turn it off for better.\n\n* There is also a option to choose whether you want to use the class name as the Source file name if exists (It's not recommended all time)\n\nThis function can be found in Apk Tools => Apk Functions "},{"Title":"Log-cat injection","Info":"This function can help you to see live exception of your app of crashing (For VIP users)\n\n\nThis function can be found in Apk Tools => Apk Functions "},{"Title":"Kill signature Verification","Info":"This function can help you to kill apk signature verification..\n\nThere is a VIP function called Kill Pairrip Protection can help you to break Google's Pairrip Protection \n\n\nThis function can be found in Apk Tools => Apk Functions "},{"Title":"Apk Signer","Info":"This function can help to sign your apk file with custom signature key\n\nThis function can be found in Apk Tools => Apk Signer"}]